atsam-rs/atsam-pac/svd/ATSAM4EE.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AFEC1</name>
      <version>11147D</version>
      <description>Analog-Front-End Controller 1</description>
      <groupName>AFEC</groupName>
      <prependToName>AFEC1_</prependToName>
      <baseAddress>0x400B4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>AFEC1</name>
        <value>31</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>AFEC Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>START</name>
              <description>Start Conversion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AUTOCAL</name>
              <description>Automatic Calibration of AFEC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>AFEC Mode Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRGEN</name>
              <description>Trigger Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Hardware triggers are disabled. Starting a conversion is only possible by software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Hardware trigger selected by TRGSEL field is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>Trigger Selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AFEC_TRIG0</name>
                  <description>ADTRG pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFEC_TRIG1</name>
                  <description>TIO Output of the Timer Counter Channel 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFEC_TRIG2</name>
                  <description>TIO Output of the Timer Counter Channel 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFEC_TRIG3</name>
                  <description>TIO Output of the Timer Counter Channel 2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFEC_TRIG4</name>
                  <description>PWM Event Line 0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFEC_TRIG5</name>
                  <description>PWM Event Line 1</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEEP</name>
              <description>Sleep Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal Mode: The AFEC Core and reference voltage circuitry are kept ON between conversions</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <description>Sleep Mode: The AFEC Core and reference voltage circuitry are OFF between conversions</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FWUP</name>
              <description>Fast Wake-up</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Normal Sleep Mode: The sleep mode is defined by the SLEEP bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Fast Wake Up Sleep Mode: The Voltage reference is ON between conversions and AFEC Core is OFF</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREERUN</name>
              <description>Free Run Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Normal Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Free Run Mode: Never wait for any trigger.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESCAL</name>
              <description>Prescaler Rate Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STARTUP</name>
              <description>Start-up Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUT0</name>
                  <description>0 periods of AFEClock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT8</name>
                  <description>8 periods of AFEClock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT16</name>
                  <description>16 periods of AFEClock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT24</name>
                  <description>24 periods of AFEClock</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT64</name>
                  <description>64 periods of AFEClock</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT80</name>
                  <description>80 periods of AFEClock</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT96</name>
                  <description>96 periods of AFEClock</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT112</name>
                  <description>112 periods of AFEClock</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT512</name>
                  <description>512 periods of AFEClock</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT576</name>
                  <description>576 periods of AFEClock</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT640</name>
                  <description>640 periods of AFEClock</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT704</name>
                  <description>704 periods of AFEClock</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT768</name>
                  <description>768 periods of AFEClock</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT832</name>
                  <description>832 periods of AFEClock</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT896</name>
                  <description>896 periods of AFEClock</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT960</name>
                  <description>960 periods of AFEClock</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETTLING</name>
              <description>Analog Settling Time</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AST3</name>
                  <description>3 periods of AFEClock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AST5</name>
                  <description>5 periods of AFEClock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AST9</name>
                  <description>9 periods of AFEClock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AST17</name>
                  <description>17 periods of AFEClock</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANACH</name>
              <description>Analog Change</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No analog change on channel switching: DIFF0, GAIN0 are used for all channels</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLOWED</name>
                  <description>Allows different analog settings for each channel. See AFEC_CGR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRACKTIM</name>
              <description>Tracking Time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRANSFER</name>
              <description>Transfer Period</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USEQ</name>
              <description>Use Sequence Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NUM_ORDER</name>
                  <description>Normal Mode: The controller converts channels in a simple numeric order.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG_ORDER</name>
                  <description>User Sequence Mode: The sequence respects what is defined in AFEC_SEQR1 and AFEC_SEQR2.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMR</name>
          <description>AFEC Extended Mode Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMPMODE</name>
              <description>Comparison Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Generates an event when the converted data is lower than the low threshold of the window.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Generates an event when the converted data is higher than the high threshold of the window.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <description>Generates an event when the converted data is in the comparison window.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <description>Generates an event when the converted data is out of the comparison window.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMPSEL</name>
              <description>Comparison Selected Channel</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPALL</name>
              <description>Compare All Channels</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPFILTER</name>
              <description>Compare Event Filtering</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RES</name>
              <description>Resolution</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_AVERAGE</name>
                  <description>12-bit resolution, AFEC sample rate is maximum (no averaging).</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW_RES</name>
                  <description>10-bit resolution, AFEC sample rate is maximum (no averaging).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR4</name>
                  <description>13-bit resolution, AFEC sample rate divided by 4 (averaging).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR16</name>
                  <description>14-bit resolution, AFEC sample rate divided by 16 (averaging).</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR64</name>
                  <description>15-bit resolution, AFEC sample rate divided by 64 (averaging).</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR256</name>
                  <description>16-bit resolution, AFEC sample rate divided by 256 (averaging).</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFEMODE</name>
              <description>AFE Running Mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal mode of operation.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET_ERROR</name>
                  <description>Offset Error mode to measure the offset error.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN_ERROR_HIGH</name>
                  <description>Gain Error mode to measure the gain error.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN_ERROR_LOW</name>
                  <description> </description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAG</name>
              <description>TAG of the AFEC_LDCR</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STM</name>
              <description>Single Trigger Mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIGNMODE</name>
              <description>Sign Mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SE_UNSG_DF_SIGN</name>
                  <description>Single-Ended Channels: Unsigned conversions.Differential Channels: Signed conversions.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE_SIGN_DF_UNSG</name>
                  <description>Single-Ended Channels: Signed conversions.Differential Channels: Unsigned conversions.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_UNSIGNED</name>
                  <description>All Channels: Unsigned conversions.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_SIGNED</name>
                  <description>All Channels: Signed conversions.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
